using System;


namespace laba_4;

class Program
{

    // as приведение типо       в
    // пример приведения типов с помощью as 
    // object obj = "Hello";
    // string str = obj as string; 
    // Console.WriteLine(str);



    static void Main(string[] args)
    {

       
    }





}
//1. Чем класс отличается от структуры?
//Классы являются ссылочными типами, а структуры — значимыми. 
//Классы могут содержать в себе поля, методы, свойства, события, индексаторы, конструкторы, деструкторы, операторы, вложенные типы и интерфейсы.

//2 Что может и чего не может быть в структуре?

//Что такое перечисление? Приведите пример определения и использования перечисления 
//Перечисление — это тип данных, который представляет собой набор именованных констант.
//. Перечислите и поясните стандартные интерфейсы .Net

//IDisposable - интерфейс, который позволяет освободить ресурсы, занятые объектом.
//IComparable - интерфейс, который позволяет сравнивать объекты.
//IComparer - интерфейс, который позволяет сравнивать объекты.








//. Что такое полиморфизм?

//Полиморфизм — это свойство системы, позволяющее использовать объекты с одинаковой спецификацией без информации о конкретном типе их реализации.
//8. Зачем в классе определяют виртуальные методы?

//Виртуальные методы используются для переопределения в производных классах.q   
// структура это - 